In [1]:
import pandas as pd

In [2]:
roll_no = [1,2,3,4,5,6,7]

In [7]:
series = pd.Series(roll_no)

In [8]:
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [9]:
var1 = [1,2,3,4,5,6,7,8,9,10]

In [10]:
print(pd.Series(var1))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
data = {
    'Name':['Alice','Bob','Claire'],
    'Age': [25,30,27],
    'Gender':['Female','Male',"Female"]
}

In [17]:
df = pd.DataFrame(data)

In [18]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. A DataFrame is a two-dimensional data structure that can store data of different types (such as strings, integers, floats, etc.) in columns. It is similar to a spreadsheet or a SQL table. A Series is a one-dimensional data structure that can store data of a single type. It is similar to a list or an array. A DataFrame can be seen as a collection of Series that share the same index.

In [19]:
# Create four series
name = pd.Series(["Alice", "Bob", "Charlie", "David"], name="Name")
age = pd.Series([25, 30, 35, 40], name="Age")
# Create a dataframe from the series
df = pd.concat([name, age], axis=1)

# Print the dataframe
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

Q.5) Some common functions that can be used to manipulate data in a Pandas DataFrame are:

df.head(n) returns the first n rows of the DataFrame.<br>
df.tail(n) returns the last n rows of the DataFrame.<br>
df.describe() returns a summary of statistics for the numerical columns of the DataFrame.<br>
df.sort_values(by=column) returns a sorted DataFrame by the values of the specified column.<br>
df.dropna() returns a DataFrame with any rows containing missing values removed.<br>
df.fillna(value) returns a DataFrame with any missing values replaced by the specified value.<br>
df.apply(function) returns a DataFrame with the function applied to each column or row.<br>
df.merge(other) returns a DataFrame with the columns of both DataFrames joined on common keys.<br>

Q6. Series, DataFrame, and Panel are all mutable in nature, meaning that they can be changed or modified after creation. However, Series is size immutable, meaning that its length cannot be changed. DataFrame and Panel are size mutable, meaning that their dimensions can be changed by adding or removing rows or columns.

Q7. To create a DataFrame using multiple Series, we can use the pd.concat() function with the axis=1 argument to specify that we want to concatenate the Series along the columns. For example, suppose we have the following three Series:

In [24]:
df = pd.concat([name, age], axis=1)

# Print the dataframe
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40